In [2]:
import pandas as pd
import numpy as np

In [3]:
df=pd.read_csv("D:\samples_data.csv")
df

   id     name    age   gender     salary   join_date department  score
0   1    Alice   25.0        F    50000.0  2021-05-10      Sales   88.0
1   2      Bob   30.0        M    62000.0  2020/03/15         HR   92.0
2   3  Charlie    NaN        M    58000.0  15-07-2019         IT   79.0
3   4    david   45.0     male        NaN          IT        NaN    NaN
4   5      Eve   -3.0        F    72000.0  2022-13-01        NaN   65.0
5   5      Eve  200.0      NaN  1000000.0  2018-11-20    Finance  300.0
6   7    Frank   33.0        M    54000.0  wrong_date    finance   73.0
7   8      NaN   29.0   FEMALE    51000.0  2021-09-01      Sales   85.0
8   9   Grace     NaN        F    49000.0  2020/12/01      SALES   90.0
9  10    Henry   41.0  Unknown        NaN  2017-05-05         IT   82.0

# clean and preprocess the data

In [7]:
df['gender'].unique()

array(['female', 'male', nan], dtype=object)

In [8]:
df['department'].unique()

array(['sales', 'HR', 'IT', nan, 'finance'], dtype=object)

In [5]:
df['gender']=df['gender'].map({'M':'male','F':'female','FEMALE':'female','male':'male','unknown':np.nan})

In [6]:
df['department']=df['department'].map({'SALES':'sales','Sales':'sales','Finance':'finance','HR':'HR','IT':'IT'})

In [ ]:
# or

In [ ]:
df["gender_clean"] = (
    df["gender"]
    .astype(str)
    .str.strip()
    .str.lower()
    .map({
        "m": "Male",
        "male": "Male",
        "f": "Female",
        "female": "Female"
    })
    .fillna("Other")
)

In [ ]:
df["department_clean"] = (
    df["department"]
    .astype(str)
    .str.strip()
    .str.lower()
    .map({
        "sales": "Sales",
        "it": "IT",
        "hr": "HR",
        "finance": "Finance"
    })
)

df["department_clean"] = df["department_clean"].fillna("Unknown")

In [27]:
df.department.unique()

array(['sales', 'HR', 'IT', nan, 'finance'], dtype=object)

In [9]:
df

   id     name    age  gender     salary   join_date department  score
0   1    Alice   25.0  female    50000.0  2021-05-10      sales   88.0
1   2      Bob   30.0    male    62000.0  2020/03/15         HR   92.0
2   3  Charlie    NaN    male    58000.0  15-07-2019         IT   79.0
3   4    david   45.0    male        NaN          IT        NaN    NaN
4   5      Eve   -3.0  female    72000.0  2022-13-01        NaN   65.0
5   5      Eve  200.0     NaN  1000000.0  2018-11-20    finance  300.0
6   7    Frank   33.0    male    54000.0  wrong_date        NaN   73.0
7   8      NaN   29.0  female    51000.0  2021-09-01      sales   85.0
8   9   Grace     NaN  female    49000.0  2020/12/01      sales   90.0
9  10    Henry   41.0     NaN        NaN  2017-05-05         IT   82.0

In [10]:
df.dtypes

id              int64
name           object
age           float64
gender         object
salary        float64
join_date      object
department     object
score         float64
dtype: object

In [ ]:
clean and corrected join_date column for your messy dataset — handling all issues:

mixed formats (YYYY-MM-DD, YYYY/MM/DD, DD-MM-YYYY)

impossible dates (2022-13-01)

non-date strings (IT, wrong_date)

proper conversion to datetime

In [ ]:
Your values look like:

2021-05-10 → %Y-%m-%d

2020/03/15 → %Y/%m/%d

15-07-2019 → %d-%m-%Y

2022-13-01 → invalid

wrong_date → invalid

IT → not a date

In [11]:
#YYYY-MM-DD
df["join_date_clean"] = pd.to_datetime(df["join_date"])

ValueError: time data "2020/03/15" doesn't match format "%Y-%m-%d", at position 1. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.

In [14]:
df["join_date_clean"] = pd.to_datetime(
    df["join_date"], errors="coerce",dayfirst=True)

In [15]:
df

,id,name,age,gender,salary,join_date,department,score,join_date_clean
0,1,Alice,25.0,female,50000.0,2021-05-10,sales,88.0,2021-10-05
1,2,Bob,30.0,male,62000.0,2020/03/15,HR,92.0,NaT
2,3,Charlie,NaN,male,58000.0,15-07-2019,IT,79.0,NaT
3,4,david,45.0,male,NaN,IT,NaN,NaN,NaT
4,5,Eve,-3.0,female,72000.0,2022-13-01,NaN,65.0,2022-01-13
5,5,Eve,200.0,NaN,1000000.0,2018-11-20,finance,300.0,NaT
6,7,Frank,33.0,male,54000.0,wrong_date,NaN,73.0,NaT
7,8,NaN,29.0,female,51000.0,2021-09-01,sales,85.0,2021-01-09
8,9,Grace,NaN,female,49000.0,2020/12/01,sales,90.0,NaT
9,10,Henry,41.0,NaN,NaN,2017-05-05,IT,82.0,2017-05-05

In [16]:
df["join_date_clean"] = pd.to_datetime(
    df["join_date"],
    format="mixed",
    errors="coerce",
    dayfirst=True
)

In [17]:
df

,id,name,age,gender,salary,join_date,department,score,join_date_clean
0,1,Alice,25.0,female,50000.0,2021-05-10,sales,88.0,2021-05-10
1,2,Bob,30.0,male,62000.0,2020/03/15,HR,92.0,2020-03-15
2,3,Charlie,NaN,male,58000.0,15-07-2019,IT,79.0,2019-07-15
3,4,david,45.0,male,NaN,IT,NaN,NaN,NaT
4,5,Eve,-3.0,female,72000.0,2022-13-01,NaN,65.0,2022-01-13
5,5,Eve,200.0,NaN,1000000.0,2018-11-20,finance,300.0,2018-11-20
6,7,Frank,33.0,male,54000.0,wrong_date,NaN,73.0,NaT
7,8,NaN,29.0,female,51000.0,2021-09-01,sales,85.0,2021-09-01
8,9,Grace,NaN,female,49000.0,2020/12/01,sales,90.0,2020-12-01
9,10,Henry,41.0,NaN,NaN,2017-05-05,IT,82.0,2017-05-05

In [18]:
df.dtypes

id                          int64
name                       object
age                       float64
gender                     object
salary                    float64
join_date                  object
department                 object
score                     float64
join_date_clean    datetime64[ns]
dtype: object

In [ ]:
Why dayfirst=True?

Because you have dates like 15-07-2019, which are in DD-MM-YYYY format.

errors="coerce"
is used in pandas date parsing to prevent your code from crashing when a value cannot be converted into a valid date.

pd.to_datetime("wrong_date", errors="coerce")
# Output: NaT

pd.to_datetime("wrong_date")

In [21]:
df["join_year"] = df["join_date_clean"].dt.month

In [23]:
df

,id,name,age,gender,salary,join_date,department,score,join_date_clean,join_year
0,1,Alice,25.0,female,50000.0,2021-05-10,sales,88.0,2021-05-10,5.0
1,2,Bob,30.0,male,62000.0,2020/03/15,HR,92.0,2020-03-15,3.0
2,3,Charlie,NaN,male,58000.0,15-07-2019,IT,79.0,2019-07-15,7.0
3,4,david,45.0,male,NaN,IT,NaN,NaN,NaT,NaN
4,5,Eve,-3.0,female,72000.0,2022-13-01,NaN,65.0,2022-01-13,1.0
5,5,Eve,200.0,NaN,1000000.0,2018-11-20,finance,300.0,2018-11-20,11.0
6,7,Frank,33.0,male,54000.0,wrong_date,NaN,73.0,NaT,NaN
7,8,NaN,29.0,female,51000.0,2021-09-01,sales,85.0,2021-09-01,9.0
8,9,Grace,NaN,female,49000.0,2020/12/01,sales,90.0,2020-12-01,12.0
9,10,Henry,41.0,NaN,NaN,2017-05-05,IT,82.0,2017-05-05,5.0

# Group by department and get average salary

In [ ]:
# make agroup on the basis of catrgorical column

In [24]:
dept=df.groupby("department")

In [25]:
dept

In [5]:
dept.size() # count the no of rows in each group

department
Finance    1
HR         1
IT         2
SALES      1
Sales      2
finance    1
dtype: int64

In [10]:
# dept["id"].count() # botth are same

department
Finance    1
HR         1
IT         2
SALES      1
Sales      2
finance    1
Name: id, dtype: int64

In [6]:
dept.first() # give the first row

            id     name    age gender     salary   join_date  score
department
Finance      5      Eve  200.0   None  1000000.0  2018-11-20  300.0
HR           2      Bob   30.0      M    62000.0  2020/03/15   92.0
IT           3  Charlie   41.0      M    58000.0  15-07-2019   79.0
SALES        9   Grace     NaN      F    49000.0  2020/12/01   90.0
Sales        1    Alice   25.0      F    50000.0  2021-05-10   88.0
finance      7    Frank   33.0      M    54000.0  wrong_date   73.0

In [7]:
dept.last()

            id     name    age   gender     salary   join_date  score
department
Finance      5      Eve  200.0     None  1000000.0  2018-11-20  300.0
HR           2      Bob   30.0        M    62000.0  2020/03/15   92.0
IT          10    Henry   41.0  Unknown    58000.0  2017-05-05   82.0
SALES        9   Grace     NaN        F    49000.0  2020/12/01   90.0
Sales        8    Alice   29.0   FEMALE    51000.0  2021-09-01   85.0
finance      7    Frank   33.0        M    54000.0  wrong_date   73.0

In [26]:
dept.groups # give the index of all group

{'HR': [1], 'IT': [2, 9], 'finance': [5], 'sales': [0, 7, 8]}

In [ ]:
len(dept) #or
df['department'].nunique()

In [29]:
# Access a single group (e.g., “IT” department)
dept.get_group("sales")

,id,name,age,gender,salary,join_date,department,score,join_date_clean,join_year
0,1,Alice,25.0,female,50000.0,2021-05-10,sales,88.0,2021-05-10,5.0
7,8,NaN,29.0,female,51000.0,2021-09-01,sales,85.0,2021-09-01,9.0
8,9,Grace,NaN,female,49000.0,2020/12/01,sales,90.0,2020-12-01,12.0

In [ ]:
df[df['department']=='IT']

# SCENARIO 1 — Group by department & compute average salary

In [30]:
 df.groupby("department")['salary'].mean()

department
HR           62000.0
IT           58000.0
finance    1000000.0
sales        50000.0
Name: salary, dtype: float64

In [4]:
dept

department
Finance    1000000.0
HR           62000.0
IT           58000.0
SALES        49000.0
Sales        50500.0
finance      54000.0
Name: salary, dtype: float64

#  SCENARIO 2 — Group by department & compute total salary

In [31]:
dept = df.groupby("department")['salary'].sum()
dept

department
HR           62000.0
IT           58000.0
finance    1000000.0
sales       150000.0
Name: salary, dtype: float64

In [18]:
dept = df.groupby("department").sum()['salary'].sort_values(ascending=False)
dept

department
Finance    1000000.0
Sales       101000.0
HR           62000.0
Name: salary, dtype: float64

# SCENARIO 3 — Group by gender with normalized category

In [37]:
df.groupby("gender")["age"].mean()

gender
female    17.0
male      36.0
Name: age, dtype: float64

# SCENARIO 4 — Count employees per department

In [38]:
df.groupby("department")["id"].count()

department
HR         1
IT         2
finance    1
sales      3
Name: id, dtype: int64

In [ ]:
# SCENARIO 4 — Group by department and get multiple aggregations

In [32]:
df.groupby("department").agg({
    "salary": ["mean", "min", "max"],
    "score": "mean"
})

               salary                             score
                 mean        min        max        mean
department
HR            62000.0    62000.0    62000.0   92.000000
IT            58000.0    58000.0    58000.0   80.500000
finance     1000000.0  1000000.0  1000000.0  300.000000
sales         50000.0    49000.0    51000.0   87.666667

# handle the age column

In [40]:
df['age']

0     25.0
1     30.0
2      NaN
3     45.0
4     -3.0
5    200.0
6     33.0
7     29.0
8      NaN
9     41.0
Name: age, dtype: float64

In [34]:
df["age_clean"] = df["age"].apply(lambda x: np.nan if x < 0 or x > 120 else x)

In [37]:
df["age_group"] = pd.cut(df["age_clean"], bins=[0,20,30,40,50,100],
                         labels=["0–20","21–30","31–40","41–50","50+"])

In [36]:
df

,id,name,age,gender,salary,join_date,department,score,join_date_clean,join_year,age_clean,age_group
0,1,Alice,25.0,female,50000.0,2021-05-10,sales,88.0,2021-05-10,5.0,25.0,21–30
1,2,Bob,30.0,male,62000.0,2020/03/15,HR,92.0,2020-03-15,3.0,30.0,21–30
2,3,Charlie,NaN,male,58000.0,15-07-2019,IT,79.0,2019-07-15,7.0,NaN,NaN
3,4,david,45.0,male,NaN,IT,NaN,NaN,NaT,NaN,45.0,41–50
4,5,Eve,-3.0,female,72000.0,2022-13-01,NaN,65.0,2022-01-13,1.0,NaN,NaN
5,5,Eve,200.0,NaN,1000000.0,2018-11-20,finance,300.0,2018-11-20,11.0,NaN,NaN
6,7,Frank,33.0,male,54000.0,wrong_date,NaN,73.0,NaT,NaN,33.0,31–40
7,8,NaN,29.0,female,51000.0,2021-09-01,sales,85.0,2021-09-01,9.0,29.0,21–30
8,9,Grace,NaN,female,49000.0,2020/12/01,sales,90.0,2020-12-01,12.0,NaN,NaN
9,10,Henry,41.0,NaN,NaN,2017-05-05,IT,82.0,2017-05-05,5.0,41.0,41–50

In [38]:
df.groupby("age_group")["salary"].mean()

C:\Users\complere\AppData\Local\Temp\ipykernel_8472\1231005768.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby("age_group")["salary"].mean()

age_group
0–20              NaN
21–30    54333.333333
31–40    54000.000000
41–50             NaN
50+               NaN
Name: salary, dtype: float64

In [39]:
df.groupby("age_group")["salary"].count()

C:\Users\complere\AppData\Local\Temp\ipykernel_8472\462720326.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby("age_group")["salary"].count()

age_group
0–20     0
21–30    3
31–40    1
41–50    0
50+      0
Name: salary, dtype: int64

# SCENARIO 6 — Group by join year

In [46]:
df.groupby("join_year")["id"].count()

join_year
2017.0    1
2018.0    1
2019.0    1
2020.0    2
2021.0    2
2022.0    1
Name: id, dtype: int64

# SCENARIO 7 — Group by name (duplicate employees detection)

In [49]:
df.groupby("name")["id"].count()

name
 Grace     1
Alice      1
Bob        1
Charlie    1
Eve        2
Frank      1
Henry      1
david      1
Name: id, dtype: int64

# Group by department & gender together

In [51]:
df.groupby(["department", "gender"])["salary"].mean()

department  gender
HR          male      62000.0
IT          male      58000.0
sales       female    50000.0
Name: salary, dtype: float64

In [ ]:
dept=df.groupby("department")

In [12]:
print(dept["salary"].mean())        # average salary

department
Finance    1000000.0
HR           62000.0
IT           58000.0
SALES        49000.0
Sales        50500.0
finance      54000.0
Name: salary, dtype: float64

In [13]:
print(dept["age"].max())            # max age

department
Finance    200.0
HR          30.0
IT          41.0
SALES        NaN
Sales       29.0
finance     33.0
Name: age, dtype: float64

In [14]:
print(dept["score"].min())          # min score

department
Finance    300.0
HR          92.0
IT          79.0
SALES       90.0
Sales       85.0
finance     73.0
Name: score, dtype: float64

In [20]:
#Group by gender and compute multiple aggregations
df.groupby("gender").agg({
    "age": "mean",
    "salary": "mean",
    "score": "mean"
})

          age   salary      score
gender
F        11.0  57000.0  81.000000
FEMALE   29.0  51000.0  85.000000
M        31.5  58000.0  81.333333
Unknown  41.0      NaN  82.000000
male     45.0      NaN        NaN

In [29]:
df

   id     name    age   gender     salary   join_date department  score
0   1    Alice   25.0   Female    50000.0  2021-05-10      Sales   88.0
1   2      Bob   30.0     Male    62000.0  2020/03/15         HR   92.0
2   3  Charlie    NaN     Male    58000.0  15-07-2019         IT   79.0
3   4    david   45.0     Male        NaN          IT        NaN    NaN
4   5      Eve   -3.0   Female    72000.0  2022-13-01        NaN   65.0
5   5      Eve  200.0      NaN  1000000.0  2018-11-20    Finance  300.0
6   7    Frank   33.0     Male    54000.0  wrong_date    finance   73.0
7   8      NaN   29.0   Female    51000.0  2021-09-01      Sales   85.0
8   9   Grace     NaN   Female    49000.0  2020/12/01      SALES   90.0
9  10    Henry   41.0  Unknown        NaN  2017-05-05         IT   82.0

In [ ]:
Group by department with multiple metrics
df.groupby("department").agg(
    avg_age=("age", "mean"),
    max_salary=("salary", "max"),
    min_salary=("salary", "min"),
    avg_score=("score", "mean")
)

In [56]:
df

,id,name,age,gender,salary,join_date,department,score,join_date_clean,age_clean,age_group,join_year
0,1,Alice,25.0,female,50000.0,2021-05-10,sales,88.0,2021-05-10,25.0,21–30,2021.0
1,2,Bob,30.0,male,62000.0,2020/03/15,HR,92.0,2020-03-15,30.0,21–30,2020.0
2,3,Charlie,NaN,male,58000.0,15-07-2019,IT,79.0,2019-07-15,NaN,NaN,2019.0
3,4,david,45.0,male,NaN,IT,NaN,NaN,NaT,45.0,41–50,NaN
4,5,Eve,-3.0,female,72000.0,2022-13-01,NaN,65.0,2022-01-13,NaN,NaN,2022.0
5,5,Eve,200.0,NaN,1000000.0,2018-11-20,finance,300.0,2018-11-20,NaN,NaN,2018.0
6,7,Frank,33.0,male,54000.0,wrong_date,NaN,73.0,NaT,33.0,31–40,NaN
7,8,NaN,29.0,female,51000.0,2021-09-01,sales,85.0,2021-09-01,29.0,21–30,2021.0
8,9,Grace,NaN,female,49000.0,2020/12/01,sales,90.0,2020-12-01,NaN,NaN,2020.0
9,10,Henry,41.0,NaN,NaN,2017-05-05,IT,82.0,2017-05-05,41.0,41–50,2017.0

# pivot

In [ ]:
pivot() is used to reshape data — it converts rows into columns based on unique values.

In [ ]:
  student  subject  marks                       
0       A     Math     90             
1       A  Science     85
2       B     Math     80
3       B  Science     88

In [ ]:
subject  Math  Science
student                
A          90       85
B          80       88

In [ ]:
Parameter	Meaning
index	What becomes the new row labels
columns	What becomes the new column labels
values	What fills the table

In [4]:
#Average salary per department
pd.pivot_table(
    df,
    values="salary",
    index="department",
    columns="gender",
    aggfunc="mean"
)

gender            F   FEMALE        M
department
HR              NaN      NaN  62000.0
IT              NaN      NaN  58000.0
SALES       49000.0      NaN      NaN
Sales       50000.0  51000.0      NaN
finance         NaN      NaN  54000.0

In [55]:
#Pivot Table With Multiple Aggregations
#Example: Calculate mean salary, max score, and count of employees per department
pd.pivot_table(
    df,
    values=["salary", "score"],
    index="department",
    aggfunc={"salary": "mean", "score": "max"}
)

               salary  score
department
HR            62000.0   92.0
IT            58000.0   82.0
finance     1000000.0  300.0
sales         50000.0   90.0

In [58]:
#Pivot Table With Fill Missing Values

#Sometimes pivot produces NaN. Use fill_value=.

pd.pivot_table(
    df,
    values="salary",
    index="department",
    columns="gender",
    aggfunc="mean",
    fill_value=0
)

gender       female     male
department
HR              0.0  62000.0
IT              0.0  58000.0
sales       50000.0      0.0

# melt

In [ ]:
#reshape the data ,unpivot the dataframe from( wide format ------> long format)
# col----->row
It is one of the most important functions when preparing data for visualization (especially in Seaborn).

In [ ]:
subject  Math  Science
student                
A          90       85
B          80       88

In [ ]:
  student  subject  marks                       
0       A     Math     90             
1       A  Science     85
2       B     Math     80
3       B  Science     88

In [ ]:
#Wide Format (multiple columns)
batsman   2015   2016   2017
Kohli     400    500    600
Rohit     450    480    520

In [ ]:
#Long Format (melted)
batsman   Year   Runs
Kohli     2015   400
Kohli     2016   500
Kohli     2017   600
Rohit     2015   450
Rohit     2016   480
Rohit     2017   520

In [ ]:
df.melt(id_vars, value_vars, var_name, value_name)

In [ ]:
df.melt(id_vars(index),value_vars(categorical),

In [5]:
df = pd.DataFrame({
    'batsman': ['Kohli', 'Rohit'],
    '2015': [400, 450],
    '2016': [500, 480],
    '2017': [600, 520]
})
df

  batsman  2015  2016  2017
0   Kohli   400   500   600
1   Rohit   450   480   520

In [6]:
long_df = df.melt(
    id_vars='batsman',
    var_name='Year',
    value_name='Runs'
)

print(long_df)

  batsman  Year  Runs
0   Kohli  2015   400
1   Rohit  2015   450
2   Kohli  2016   500
3   Rohit  2016   480
4   Kohli  2017   600
5   Rohit  2017   520

# filter the data based on condition

In [ ]:
df[df['department']=='IT']       # filtering

In [30]:
df["department"].isin(["Sales", "IT"])

0     True
1    False
2     True
3    False
4    False
5    False
6    False
7     True
8    False
9     True
Name: department, dtype: bool

In [31]:
df[df["department"].isin(["Sales", "IT"])]

   id     name   age   gender   salary   join_date department  score
0   1    Alice  25.0   Female  50000.0  2021-05-10      Sales   88.0
2   3  Charlie   NaN     Male  58000.0  15-07-2019         IT   79.0
7   8      NaN  29.0   Female  51000.0  2021-09-01      Sales   85.0
9  10    Henry  41.0  Unknown      NaN  2017-05-05         IT   82.0

In [32]:
df["salary"].isna() # same as isnull

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7    False
8    False
9     True
Name: salary, dtype: bool

In [33]:
#Find rows with missing values using isna()
df[df["salary"].isna()]

   id   name   age   gender  salary   join_date department  score
3   4  david  45.0     Male     NaN          IT        NaN    NaN
9  10  Henry  41.0  Unknown     NaN  2017-05-05         IT   82.0

# merging

In [7]:
import numpy as np

In [8]:
df1 = pd.DataFrame({
    "id": [1, 2, 3, 4, np.nan],
    "name": ["Alice", "Bob", None, "David", "Eva"],
    "department": ["Sales", None, "IT", "Finance", "HR"]
})

In [5]:
df1

    id   name department
0  1.0  Alice      Sales
1  2.0    Bob       None
2  3.0   None         IT
3  4.0  David    Finance
4  NaN    Eva         HR

In [9]:
df2 = pd.DataFrame({
    "id": [1, 2, None, 5, 3],
    "salary": [50000, np.nan, 58000, 70000, None],
    "join_date": ["2021-05-10", None, "2019-09-01", "2022-01-01", None]
})

In [7]:
df2

    id   salary   join_date
0  1.0  50000.0  2021-05-10
1  2.0      NaN        None
2  NaN  58000.0  2019-09-01
3  5.0  70000.0  2022-01-01
4  3.0      NaN        None

In [ ]:
#   Merge results (inner/left/right/outer)

In [10]:
#INNER JOIN
#Only rows where id matches AND is not null.

inner = pd.merge(df1, df2, on="id", how="inner")
inner

    id   name department   salary   join_date
0  1.0  Alice      Sales  50000.0  2021-05-10
1  2.0    Bob       None      NaN        None
2  3.0   None         IT      NaN        None
3  NaN    Eva         HR  58000.0  2019-09-01

In [49]:
left = pd.merge(df1, df2, on="id", how="left")
left

    id   name department   salary   join_date
0  1.0  Alice      Sales  50000.0  2021-05-10
1  2.0    Bob       None      NaN        None
2  3.0   None         IT      NaN        None
3  4.0  David    Finance      NaN         NaN
4  NaN    Eva         HR  58000.0  2019-09-01

In [11]:
right = pd.merge(df1, df2, on="id", how="right")
right

    id   name department   salary   join_date
0  1.0  Alice      Sales  50000.0  2021-05-10
1  2.0    Bob       None      NaN        None
2  NaN    Eva         HR  58000.0  2019-09-01
3  5.0    NaN        NaN  70000.0  2022-01-01
4  3.0   None         IT      NaN        None

In [ ]:
It returns:

All rows from df1

All rows from df2

Matches where id exists in both

NaN where data is missing

In [12]:
outer = pd.merge(df1, df2, on="id", how="outer")
outer

    id   name department   salary   join_date
0  1.0  Alice      Sales  50000.0  2021-05-10
1  2.0    Bob       None      NaN        None
2  3.0   None         IT      NaN        None
3  4.0  David    Finance      NaN         NaN
4  5.0    NaN        NaN  70000.0  2022-01-01
5  NaN    Eva         HR  58000.0  2019-09-01

# How to merge using multiple keys
# How to merge on index

In [13]:
df2["department"] = ["Sales", "HR", "IT", "Finance", "IT"]  # example values

In [14]:
df1

    id   name department
0  1.0  Alice      Sales
1  2.0    Bob       None
2  3.0   None         IT
3  4.0  David    Finance
4  NaN    Eva         HR

In [15]:
df2

    id   salary   join_date department
0  1.0  50000.0  2021-05-10      Sales
1  2.0      NaN        None         HR
2  NaN  58000.0  2019-09-01         IT
3  5.0  70000.0  2022-01-01    Finance
4  3.0      NaN        None         IT

In [16]:
merged = pd.merge(df1, df2, on=['id', 'department'], how="inner")
merged

    id   name department   salary   join_date
0  1.0  Alice      Sales  50000.0  2021-05-10
1  3.0   None         IT      NaN        None

In [17]:
# Merge Using Multiple Keys With Different Column Names

pd.merge(
    df1,
    df2,
    left_on=["emp_id", "dept"],
    right_on=["id", "department"]
)

KeyError: 'emp_id'

# Using join() Instead of merge()

In [ ]:
join() is a shortcut for merging on index.

In [55]:
merged = df1.join(df2, how="left")
merged

ValueError: columns overlap but no suffix specified: Index(['id', 'department'], dtype='object')

In [58]:
merged = df1.join(df2, how="left", lsuffix="_df1", rsuffix="_df2")
merged

   id_df1   name department_df1  id_df2   salary   join_date department_df2
0     1.0  Alice          Sales     1.0  50000.0  2021-05-10          Sales
1     2.0    Bob           None     2.0      NaN        None             HR
2     3.0   None             IT     NaN  58000.0  2019-09-01             IT
3     4.0  David        Finance     5.0  70000.0  2022-01-01        Finance
4     NaN    Eva             HR     3.0      NaN        None             IT

# concatination

In [59]:
result = pd.concat([df1, df2], axis=0)
result

    id   name department   salary   join_date
0  1.0  Alice      Sales      NaN         NaN
1  2.0    Bob       None      NaN         NaN
2  3.0   None         IT      NaN         NaN
3  4.0  David    Finance      NaN         NaN
4  NaN    Eva         HR      NaN         NaN
0  1.0    NaN      Sales  50000.0  2021-05-10
1  2.0    NaN         HR      NaN        None
2  NaN    NaN         IT  58000.0  2019-09-01
3  5.0    NaN    Finance  70000.0  2022-01-01
4  3.0    NaN         IT      NaN        None

In [60]:
pd.concat([df1, df2], ignore_index=True)

    id   name department   salary   join_date
0  1.0  Alice      Sales      NaN         NaN
1  2.0    Bob       None      NaN         NaN
2  3.0   None         IT      NaN         NaN
3  4.0  David    Finance      NaN         NaN
4  NaN    Eva         HR      NaN         NaN
5  1.0    NaN      Sales  50000.0  2021-05-10
6  2.0    NaN         HR      NaN        None
7  NaN    NaN         IT  58000.0  2019-09-01
8  5.0    NaN    Finance  70000.0  2022-01-01
9  3.0    NaN         IT      NaN        None

In [61]:
result = pd.concat([df1, df2], axis=1)
result

    id   name department   id   salary   join_date department
0  1.0  Alice      Sales  1.0  50000.0  2021-05-10      Sales
1  2.0    Bob       None  2.0      NaN        None         HR
2  3.0   None         IT  NaN  58000.0  2019-09-01         IT
3  4.0  David    Finance  5.0  70000.0  2022-01-01    Finance
4  NaN    Eva         HR  3.0      NaN        None         IT

# Select columns by data type

In [ ]:
df.select_dtypes(include="number")     # All numeric columns
df.select_dtypes(include="object")     # All object (string) columns
df.select_dtypes(include="category")   # All categorical columns

In [9]:
df_new=df1.select_dtypes(include="number")     # All numeric columns
df_new

    id
0  1.0
1  2.0
2  3.0
3  4.0
4  NaN

In [ ]:
num_df.mean()
num_df.sum()
num_df.describe()

In [ ]:
for i in df_new:
    df[i].fillna(round(df[i].mean(),0),inplace=True)

In [64]:
df.select_dtypes(include="object")

      name   gender   join_date department
0    Alice   Female  2021-05-10      Sales
1      Bob     Male  2020/03/15         HR
2  Charlie     Male  15-07-2019         IT
3    david     Male          IT        NaN
4      Eve   Female  2022-13-01        NaN
5      Eve      NaN  2018-11-20    Finance
6    Frank     Male  wrong_date    finance
7      NaN   Female  2021-09-01      Sales
8   Grace    Female  2020/12/01      SALES
9    Henry  Unknown  2017-05-05         IT

In [2]:
df = pd.read_csv("D:\sample_dataset.csv",sep="\t")
df

    c1       c2        c3    c4 c5    c6
0   45        C -0.686589  10.0  y  1221
1   48  Missing  0.014873  30.0  y  3388
2   65        C -0.375666   NaN  y  1509
3   68        A -0.038224   NaN  y  3562
4   68        A  0.367974  30.0  y  3117
5   10  Missing -0.044724   NaN  z  2381
6   84        A -0.302375  20.0  z  1908
7   22  Missing -2.224404  20.0  z  1556
8   37        B  0.724006  20.0  x  1885
9   88  Missing  0.359003   NaN  y  3813
10  71        B  1.076121  30.0  z  2346
11  89        C  0.192141  10.0  y  4695
12  89        C  0.852926  10.0  y  3139
13  13        A  0.018357  20.0  y  4413
14  59        B  0.428304  10.0  y  1423
15  66        B  0.996278   NaN  x  4623
16  40        B -0.491150  30.0  z  4734
17  88        B  0.712678   NaN  z  4486
18  47      NaN  1.113340   NaN  x  4729
19  89      NaN -2.153675  30.0  y  3758
20  82        C -0.416111  10.0  y  1967
21  38      NaN -1.070897  30.0  x  1274
22  26        A  0.221139   NaN  x  1860
23  78      NaN -1.123057  30.0  x  3091
24  73  Missing -1.050758  30.0  z  2107
25  10        B  1.012079  20.0  y  1433
26  21        C  1.543716  20.0  z  1809
27  81  Missing -0.402115   NaN  y  3141
28  70      NaN  0.864749   NaN  z  2198
29  80  Missing -0.226869  10.0  x  2429
30  48  Missing  0.811160   NaN  z  1201
31  65  Missing  0.287795  10.0  x  4929
32  83      NaN -0.538468  10.0  y  3546
33  89  Missing  1.908462  30.0  y  3528
34  50  Missing -0.475776  30.0  y  3011
35  30  Missing  1.440731   NaN  x  1329
36  20        A -1.149076  20.0  x  4612
37  20  Missing  0.805715  20.0  x  1209
38  15      NaN  1.756107  10.0  x  3665
39  40        C  0.972980   NaN  x  2978
40  33        A -1.551119  10.0  x  4968
41  66        B  0.191143  30.0  y  4647
42  10        B  1.604776   NaN  x  2040
43  58      NaN -1.420026   NaN  z  3154
44  33        A -2.443783  20.0  z  1164
45  32        A -2.056339   NaN  y  1606
46  75        B -0.992258  20.0  y  4608
47  24        C  1.011285   NaN  y  3676
48  36  Missing  1.400440  30.0  z  2215
49  76        C -0.654992  10.0  y  2219

In [1]:
import pandas as pd

In [71]:
df = pd.read_csv("D:\sample_dataset.csv",
    sep="\t",                          # Separator is tab
    names=["c1","c2","c3","c4"],                 # Custom column names
    #index_col="c2",                    # Make 'c2' the index
    header=1,                          # Use row 1 as header (0-based)
    usecols=["c1","c2","c3","c4"],               # Only read these columns
    nrows=100,                         # Read only first 100 rows
    na_values=["NA","Missing"],        # Additional strings as NaN
    skiprows=[0, 2]                    # Example: skip row 0 and row 2
)

print(df.head(20))

    c1   c2        c3    c4
0   68    A -0.038224   NaN
1   68    A  0.367974  30.0
2   10  NaN -0.044724   NaN
3   84    A -0.302375  20.0
4   22  NaN -2.224404  20.0
5   37    B  0.724006  20.0
6   88  NaN  0.359003   NaN
7   71    B  1.076121  30.0
8   89    C  0.192141  10.0
9   89    C  0.852926  10.0
10  13    A  0.018357  20.0
11  59    B  0.428304  10.0
12  66    B  0.996278   NaN
13  40    B -0.491150  30.0
14  88    B  0.712678   NaN
15  47  NaN  1.113340   NaN
16  89  NaN -2.153675  30.0
17  82    C -0.416111  10.0
18  38  NaN -1.070897  30.0
19  26    A  0.221139   NaN

In [ ]:
skiprows=5        # skip first 5 rows
skiprows=[0,1,2]  # skip specific rows

# creating a dataframe

In [ ]:
Create DataFrame from a Python Dictionary

In [72]:
df = pd.DataFrame({
    "id": [1, 2, 3],
    "name": ["A", "B", "C"],
    "score": [90, 85, 88]
})

print(df)

   id name  score
0   1    A     90
1   2    B     85
2   3    C     88

In [73]:
df = pd.DataFrame({
    "id": [1, 2, 3],
    "name": ["A", None, "C"],
    "marks": [50, np.nan, 70]
})

print(df)

   id  name  marks
0   1     A   50.0
1   2  None    NaN
2   3     C   70.0

In [76]:
# list of dict
data = [
    {"id": 1, "name": "A"},
    {"id": 2, "name": "B"},
    {"id": 3, "name": "C"}
]
data

[{'id': 1, 'name': 'A'}, {'id': 2, 'name': 'B'}, {'id': 3, 'name': 'C'}]

In [74]:
df = pd.DataFrame(
    [[1, "A", 90],
     [2, "B", 80],
     [3, "C", 70]],
    columns=["id", "name", "score"]
)
df

   id name  score
0   1    A     90
1   2    B     80
2   3    C     70

# Create an Empty DataFrame

In [77]:
df = pd.DataFrame(columns=["id", "name", "salary"])
df

Empty DataFrame
Columns: [id, name, salary]
Index: []

# In pandas, string functions are available through .str accessor.

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    "name": ["alice", "BOB", "Charles", "david123", "eve_01"],
    "city": ["New York", " london", "TOKYO ", "paris", "DELHI"],
    "code": ["A1-B2", "C3 D4", "E5,F6", None, "G7/H8"]
})

In [3]:
df

       name      city   code
0     alice  New York  A1-B2
1       BOB    london  C3 D4
2   Charles    TOKYO   E5,F6
3  david123     paris   None
4    eve_01     DELHI  G7/H8

In [4]:
df.dtypes

name    object
city    object
code    object
dtype: object

In [5]:
df["name"].str.lower()

0       alice
1         bob
2     charles
3    david123
4      eve_01
Name: name, dtype: object

In [6]:
df["name"].str.upper()

0       ALICE
1         BOB
2     CHARLES
3    DAVID123
4      EVE_01
Name: name, dtype: object

In [7]:
df["name"].str.title()

0       Alice
1         Bob
2     Charles
3    David123
4      Eve_01
Name: name, dtype: object

In [71]:
df["city"].str.strip()      # remove leading + trailing spaces

0    New York
1      london
2       TOKYO
3       paris
4       DELHI
Name: city, dtype: object

In [72]:
df["city"].str.lstrip()     # left strip

0    New York
1      london
2      TOKYO
3       paris
4       DELHI
Name: city, dtype: object

In [73]:
df["city"].str.rstrip()     # right strip

0    New York
1      london
2       TOKYO
3       paris
4       DELHI
Name: city, dtype: object

In [ ]:
Find substring

In [74]:
df["city"].str.contains("on", case=False)
#case=False → ignore uppercase/lowercase
#So "on", "ON", "On", "oN" all match.

0    False
1     True
2    False
3    False
4    False
Name: city, dtype: bool

In [75]:
df["name"].str.startswith("a")

0     True
1    False
2    False
3    False
4    False
Name: name, dtype: bool

In [76]:
df["name"].str.endswith("e")

0     True
1    False
2    False
3    False
4    False
Name: name, dtype: bool

# Replace values

In [77]:
df["name"].str.replace("david", "David", case=False)

0       alice
1         BOB
2     Charles
3    David123
4      eve_01
Name: name, dtype: object

In [83]:
df["city"].str.replace("  ", "Unknown")

0    New York
1      london
2      TOKYO
3       paris
4       DELHI
Name: city, dtype: object

In [ ]:
# Split string into multiple columns

In [8]:
df

       name      city   code
0     alice  New York  A1-B2
1       BOB    london  C3 D4
2   Charles    TOKYO   E5,F6
3  david123     paris   None
4    eve_01     DELHI  G7/H8

In [9]:
df[['code1','code2']]=df["code"].str.split("-", expand=True,n=1)

In [10]:
df

       name      city   code  code1 code2
0     alice  New York  A1-B2     A1    B2
1       BOB    london  C3 D4  C3 D4  None
2   Charles    TOKYO   E5,F6  E5,F6  None
3  david123     paris   None   None  None
4    eve_01     DELHI  G7/H8  G7/H8  None

In [81]:
df["name"].str.split(" ").str[0]  # first name

0       alice
1         BOB
2     Charles
3    david123
4      eve_01
Name: name, dtype: object

In [79]:
df["name"].str.len()

0    5
1    3
2    7
3    8
4    6
Name: name, dtype: int64

In [12]:
df["code"].str.upper().fillna("NO CODE").head(2)

0    A1-B2
1    C3 D4
Name: code, dtype: object

# other example

In [13]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    "name": [" alice ", "BOB", "charlie123", "DAVID_", None],
    "email": ["alice@example.com", "bob@@mail.com", "invalid", "david@example.com", ""],
    "gender": ["f", "M", "FEMALE", "male ", None],
    "city": ["new york", "LONDON ", " tokyo", "Delhi", "MUMBAI"],
    "code": ["A1-B2", "C3 D4", np.nan, "E5,F6", "G7/H8"]
})

In [14]:
df

         name              email  gender      city   code
0      alice   alice@example.com       f  new york  A1-B2
1         BOB      bob@@mail.com       M   LONDON   C3 D4
2  charlie123            invalid  FEMALE     tokyo    NaN
3      DAVID_  david@example.com   male      Delhi  E5,F6
4        None                       None    MUMBAI  G7/H8

In [17]:
df["name_clean"] = (
    df["name"]
        .str.strip()
        .str.replace(r"[^A-Za-z]", "--", regex=True)
        .str.title()
)

In [18]:
df

         name              email  gender      city   code     name_clean
0      alice   alice@example.com       f  new york  A1-B2          Alice
1         BOB      bob@@mail.com       M   LONDON   C3 D4            Bob
2  charlie123            invalid  FEMALE     tokyo    NaN  Charlie------
3      DAVID_  david@example.com   male      Delhi  E5,F6        David--
4        None                       None    MUMBAI  G7/H8           None

In [94]:
df["valid_email"] = df["email"].str.contains(
    r"^[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\.[A-Za-z]{2,}$",
    regex=True
)

In [95]:
df

,name,email,gender,city,code,part1,part2,name_clean,valid_email
0,alice,alice@example.com,Female,new york,A1-B2,A1,B2,Alice,True
1,BOB,bob@@mail.com,Male,LONDON,C3 D4,C3 D4,None,Bob,False
2,charlie123,invalid,Female,tokyo,NaN,NaN,NaN,Charlie,False
3,DAVID_,david@example.com,Male,Delhi,"E5,F6","E5,F6",None,David,True
4,None,,NaN,MUMBAI,G7/H8,G7/H8,None,None,False

In [96]:
#Extract email username

#✔ everything before @

df["email_user"] = df["email"].str.extract(r"([^@]+)@")

In [20]:
df["email"].str.split('@').str.get(1)

0    example.com
1
2            NaN
3    example.com
4            NaN
Name: email, dtype: object

In [86]:
df["name"] = df["name"].str.strip()

In [87]:
df["city"] = df["city"].str.strip()

In [88]:
#Normalize messy gender column
#Using str.lower() + map
gender_map = {
    "f": "Female",
    "female": "Female",
    "m": "Male",
    "male": "Male"
}

df["gender"] = df["gender"].str.strip().str.lower().map(gender_map)

In [89]:
df

         name              email  gender      city   code
0       alice  alice@example.com  Female  new york  A1-B2
1         BOB      bob@@mail.com    Male    LONDON  C3 D4
2  charlie123            invalid  Female     tokyo    NaN
3      DAVID_  david@example.com    Male     Delhi  E5,F6
4        None                        NaN    MUMBAI  G7/H8

In [90]:
df[["part1", "part2"]] = df["code"].str.split("-", expand=True)

In [91]:
df

         name              email  gender      city   code  part1 part2
0       alice  alice@example.com  Female  new york  A1-B2     A1    B2
1         BOB      bob@@mail.com    Male    LONDON  C3 D4  C3 D4  None
2  charlie123            invalid  Female     tokyo    NaN    NaN   NaN
3      DAVID_  david@example.com    Male     Delhi  E5,F6  E5,F6  None
4        None                        NaN    MUMBAI  G7/H8  G7/H8  None

In [97]:
df["city_clean"] = (
    df["city"]
        .str.strip()
        .str.lower()
        .str.title()
)

In [98]:
df

,name,email,gender,city,code,part1,part2,name_clean,valid_email,email_user,city_clean
0,alice,alice@example.com,Female,new york,A1-B2,A1,B2,Alice,True,alice,New York
1,BOB,bob@@mail.com,Male,LONDON,C3 D4,C3 D4,None,Bob,False,bob,London
2,charlie123,invalid,Female,tokyo,NaN,NaN,NaN,Charlie,False,NaN,Tokyo
3,DAVID_,david@example.com,Male,Delhi,"E5,F6","E5,F6",None,David,True,david,Delhi
4,None,,NaN,MUMBAI,G7/H8,G7/H8,None,None,False,NaN,Mumbai

In [108]:
df["code_letters"] = df["code"].str.replace(r"[^A-Za-z]", "", regex=True)

In [111]:
df[["code_a","code_b"]] = df["code"].str.split(r"[- ,/]", regex=True,expand=True)

In [112]:
df

,name,email,gender,city,code,part1,part2,name_clean,valid_email,email_user,city_clean,code_letters,code_split,code_a,code_b
0,alice,alice@example.com,Female,new york,A1-B2,A1,B2,Alice,True,alice,New York,AB,"[A1, B2]",A1,B2
1,BOB,bob@@mail.com,Male,LONDON,C3 D4,C3 D4,None,Bob,False,bob,London,CD,"[C3, D4]",C3,D4
2,charlie123,invalid,Female,tokyo,NaN,NaN,NaN,Charlie,False,NaN,Tokyo,NaN,NaN,NaN,NaN
3,DAVID_,david@example.com,Male,Delhi,"E5,F6","E5,F6",None,David,True,david,Delhi,EF,"[E5, F6]",E5,F6
4,None,,NaN,MUMBAI,G7/H8,G7/H8,None,None,False,NaN,Mumbai,GH,"[G7, H8]",G7,H8

# date time

In [ ]:
Convert to datetime

Most important function:

In [ ]:
df["date"] = pd.to_datetime(df["date"], errors="coerce")

In [ ]:
df["date"] = pd.to_datetime(df["date"], errors="coerce",format='mixed', dayfirst=True)

In [ ]:
#Extract date parts
df["year"] = df["date"].dt.year
df["month"] = df["date"].dt.month
df["day"] = df["date"].dt.day
df["quarter"] = df["date"].dt.quarter
df["weekday"] = df["date"].dt.day_name()     # Monday, Tuesday...
df["weekno"] = df["date"].dt.isocalendar().week
df["hour"] = df["date"].dt.hour
df["minute"] = df["date"].dt.minute
df["second"] = df["date"].dt.second

In [ ]:
Extract only date or time
df["only_date"] = df["date"].dt.date
df["only_time"] = df["date"].dt.time

In [ ]:
Format datetime → string (strftime)
df["date_str"] = df["date"].dt.strftime("%d-%m-%Y")
df["date_str2"] = df["date"].dt.strftime("%Y/%m/%d %H:%M")

In [ ]:
Difference between dates
df["diff_days"] = (df["end"] - df["start"]).dt.days
df["diff_seconds"] = (df["end"] - df["start"]).dt.total_seconds()

In [ ]:
Filter rows by date
df[df["date"] >= "2024-01-01"]
df[df["date"].between("2024-01-01", "2024-12-31")]

In [ ]:
Replace invalid dates

Force invalid → NaT:

df["date"] = pd.to_datetime(df["date"], errors="coerce")

In [ ]:
Fill NaT:

df["date"] = df["date"].fillna(pd.Timestamp("2024-01-01"))

In [1]:
import pandas as pd

In [2]:
data = {
    "id": [1, 2, 3, 4, 5],
    "date_time": [
        "12-03-2024 14:25",
        "03/15/24 9:30 AM",
        "2024.03.17",
        "17/03/2024 18:05",
        "2024/03/18 07:45"
    ],
    "amount": [100, 200, 300, 400, 500]
}

df = pd.DataFrame(data)

In [3]:
df

   id         date_time  amount
0   1  12-03-2024 14:25     100
1   2  03/15/24 9:30 AM     200
2   3        2024.03.17     300
3   4  17/03/2024 18:05     400
4   5  2024/03/18 07:45     500

In [4]:
df["date_time"] = pd.to_datetime(df["date_time"], errors="coerce",format='mixed', dayfirst=True)

In [5]:
df

   id           date_time  amount
0   1 2024-03-12 14:25:00     100
1   2 2024-03-15 09:30:00     200
2   3 2024-03-17 00:00:00     300
3   4 2024-03-17 18:05:00     400
4   5 2024-03-18 07:45:00     500

In [6]:
df["date"] = df["date_time"].dt.date
df["time"] = df["date_time"].dt.time

In [7]:
#Extract components
df["year"] = df["date_time"].dt.year
df["month"] = df["date_time"].dt.month
df["day"] = df["date_time"].dt.day
df["hour"] = df["date_time"].dt.hour
df["minute"] = df["date_time"].dt.minute

In [16]:
df["month_name"] = df["date_time"].dt.month_name()
df["day_name"] = df["date_time"].dt.day_name()

In [8]:
#Format the datetime back to string
df["formatted"] = df["date_time"].dt.strftime("%d-%m-%Y %H:%M")

In [9]:
#Filter rows by date range
#Filter rows after 1 March 2024
df_filtered = df[df["date_time"] >= "2024-03-01"]

In [10]:
#Filter between 12 March and 17 March
df_filtered1 = df[df["date_time"].between("2024-03-12", "2024-03-17")]

In [11]:
#Sort by datetime
df = df.sort_values("date_time")

In [12]:
#Find the earliest & latest dates
df["date_time"].min()
df["date_time"].max()

Timestamp('2024-03-18 07:45:00')

In [13]:
#Add days, hours, minutes
df["plus_1_day"] = df["date_time"] + pd.Timedelta(days=1)
df["plus_2_hours"] = df["date_time"] + pd.Timedelta(hours=2)
df["minus_30_minutes"] = df["date_time"] - pd.Timedelta(minutes=30)

In [14]:
#If any invalid values became NaT:

df["date_time"] = df["date_time"].fillna(pd.Timestamp("2024-01-01"))

In [15]:
df

,id,date_time,amount,date,time,year,month,day,hour,minute,formatted,plus_1_day,plus_2_hours,minus_30_minutes
0,1,2024-03-12 14:25:00,100,2024-03-12,14:25:00,2024,3,12,14,25,12-03-2024 14:25,2024-03-13 14:25:00,2024-03-12 16:25:00,2024-03-12 13:55:00
1,2,2024-03-15 09:30:00,200,2024-03-15,09:30:00,2024,3,15,9,30,15-03-2024 09:30,2024-03-16 09:30:00,2024-03-15 11:30:00,2024-03-15 09:00:00
2,3,2024-03-17 00:00:00,300,2024-03-17,00:00:00,2024,3,17,0,0,17-03-2024 00:00,2024-03-18 00:00:00,2024-03-17 02:00:00,2024-03-16 23:30:00
3,4,2024-03-17 18:05:00,400,2024-03-17,18:05:00,2024,3,17,18,5,17-03-2024 18:05,2024-03-18 18:05:00,2024-03-17 20:05:00,2024-03-17 17:35:00
4,5,2024-03-18 07:45:00,500,2024-03-18,07:45:00,2024,3,18,7,45,18-03-2024 07:45,2024-03-19 07:45:00,2024-03-18 09:45:00,2024-03-18 07:15:00